BAS BMEKZU Project/src/Documents/ОперацияБух/ОперацияБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияБух</name>
  <basedOn>Catalog.ТиповыеОперации</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_Форма49</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыНаВыпуск</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.РозничныеПродажиПодакцизныхТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыНаПроизводство</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>InformationRegister.СчетаБухгалтерскогоУчетаНМА</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВыполненныеТехнологическиеОперации</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЦеныНаУслуги</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_СостояниеРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.КнигаДоходовРасходовПоЕдиномуНалогу</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияУдержанияПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ТопливоВТС</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_Отражение</registerRecords>
  <registerRecords>InformationRegister.НалоговыеНазначенияОС</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Остатки_Сводная</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольВвозаСобственногоЗерна</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_РезультатыНаблюденияСостоянияЗерна</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ОперативныеОстатки</registerRecords>
  <registerRecords>InformationRegister.ЛьготыПоНДФЛСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ИспользуемыеНомераПроб</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиНалоговыхНазначенийТЗР</registerRecords>
  <registerRecords>InformationRegister.ПорядокЗакрытияПодразделенийОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВыпускПродукцииОрганизации</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_ВзносыВФонды</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ДанныеПоКачествуПартийЗерна</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеНМАБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>InformationRegister.УдалитьПараметрыРасчетаИндексации</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ВзносыВФондыРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЖурналЛабораторныхАнализов</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Форма36Сводная</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетныйВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольВывозаСобственногоЗерна</registerRecords>
  <registerRecords>InformationRegister.ГрафикиАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Форма36</registerRecords>
  <registerRecords>InformationRegister.УдалитьВзносыВФондыРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииУслугБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ГарантийныеСрокиНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЗначенияБазисов</registerRecords>
  <registerRecords>InformationRegister.РасчетСписанияРБП</registerRecords>
  <registerRecords>InformationRegister.СостоянияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВзаиморасчетыПоНачислениямЗаСчетФСС</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоУдержаниям</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ПлановыеЗатратыНаВыпуск</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПлановыеУдержанияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РабочееВремяРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>InformationRegister.РасчетРаспределенияКосвенныхРасходов</registerRecords>
  <registerRecords>InformationRegister.СостоянияНМАОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСНалоговыйКредит</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиВРазрезеГарантийныхСроковНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_РасчетСреднегоЗаработка</registerRecords>
  <registerRecords>AccumulationRegister.ПереоценкаОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Остатки</registerRecords>
  <registerRecords>InformationRegister.РасчетПереоценкиВалютныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.РеализованныеТоварыКомитентов</registerRecords>
  <registerRecords>InformationRegister.ЕСВСотрудников</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПоказанияСпидометраИБака</registerRecords>
  <registerRecords>InformationRegister.СчетаБухгалтерскогоУчетаОС</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания</registerRecords>
  <registerRecords>InformationRegister.УдалитьПлановыеУдержанияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ИндексированныйДоходСовместителей</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ШтатноеРасписаниеОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПараметрыФиксированнойИндексации</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_РаботникиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьПродажиНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаНМА</registerRecords>
  <registerRecords>AccumulationRegister.НДСНалоговыеОбязательства</registerRecords>
  <registerRecords>AccumulationRegister.ПриобретенияНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_МатериалыСписанныеНаТранспорт</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_НадбавкиПоШтатномуРасписаниюОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.КоэффициентыПропорциональногоОтнесенияНДСНаКредит</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.РеализацияУслуг</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_КонтрольВеса</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСДепонентами</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПланПосева</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ДвиженияПоПереработке</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоВзносамВФонды</registerRecords>
  <registerRecords>AccumulationRegister.ЕСВПоСотрудникам</registerRecords>
  <registerRecords>InformationRegister.РасчетСебестоимостиПродукцици</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыОрганизаций</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_Удержания</registerRecords>
  <registerRecords>InformationRegister.УдалитьПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибыли</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_Начисления</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗакупкиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВедомостьДвижений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПараметрыВыплатыЗПРаботников</registerRecords>
  <registerRecords>InformationRegister.ОплатаВедомостейНаВыплатуЗарплаты</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_КоэффициентПовышенияОкладов</registerRecords>
  <registerRecords>CalculationRegister.УДАЛИТЬВзносыВФондыИНалоги</registerRecords>
  <registerRecords>InformationRegister.ПараметрыРасчетаИндексации</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьПриобретенияНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольПриказовНаВывоз</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РазницаКоличества</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаОС</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РеализацияОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ДанныеПоКачествуЗерна</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>CatalogRef.УдалитьВнешниеОбработки</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяОперация</name>
    <type>
      <types>CatalogRef.УдалитьВнешниеОбработки</types>
      <types>CatalogRef.ТиповыеОперации</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапрашиваемыеПараметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровРасчета</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ОперацияБух/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает/снимает признак активности движений документа в зависимости от пометки удаления.
// Следует вызывать перед записью измененной пометки удаления.
// Помеченный на удаление документ не должен иметь активных движений.
// Не помеченный на удаление документ может иметь неактивные движения.
Процедура СинхронизироватьАктивностьДвиженийСПометкойУдаления()
	
	
	Если (НЕ ПометкаУдаления 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = ПометкаУдаления)
		ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = Неопределено Тогда
		// Не помеченный на удаление документ может иметь неактивные движения.
		// Однако, при снятии пометки удаления все движения становятся активными.
		Возврат;
	КонецЕсли;
	
	Активность = НЕ ПометкаУдаления;
	
	Для Каждого Движение Из Движения Цикл
		
		Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
			// Набор никто не трогал
			Движение.Прочитать();
		КонецЕсли;
		
		Для Каждого Строка Из Движение Цикл
			
			Если Строка.Активность = Активность Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Активность   = Активность;
			Движение.Записывать = Истина; // На случай, если набор был прочитан выше
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРегистрНакопления(ИмяРегистра)
	
	Если ТаблицаРегистровНакопления.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровНакопления.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры
		
Процедура ДобавитьРегистрСведений(ИмяРегистра)
	
	Если ТаблицаРегистровСведений.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровСведений.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРегистрРасчета(ИмяРегистра)
	
	Если ТаблицаРегистровРасчета.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровРасчета.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ОбъектКопирования) <> Тип("ДокументОбъект.ОперацияБух") Тогда
		Возврат;
	КонецЕсли;

	Организация = ОбъектКопирования.Организация;
	Комментарий = ОбъектКопирования.Комментарий;
	Содержание  = ОбъектКопирования.Содержание;
	
	Для каждого Набор Из ОбъектКопирования.Движения Цикл
		
//++ БУ ЗИК		
//~		Если СтрНайти(ВРег(Набор.Метаданные().Имя), Врег("устарело")) > 0
//~			или СтрНайти(ВРег(Набор.Метаданные().Имя), Врег("удалить")) > 0 Тогда
//~			Продолжить;
//~		КонецЕсли;
//-- БУ ЗИК		
		
		Набор.Прочитать();
		Если Набор.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборИмяМетаданного  = Набор.Метаданные().Имя;
		НаборТекущегоОбъекта = Движения[НаборИмяМетаданного];
		Если Метаданные.РегистрыБухгалтерии.Найти(НаборИмяМетаданного) <> Неопределено Тогда
			Для каждого ЗаписьНабора Из Набор Цикл
				
				НоваяЗапись = НаборТекущегоОбъекта.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,,
					"Период,Регистратор,СубконтоДт,СубконтоКт");
				
				Для каждого Субконто Из ЗаписьНабора.СубконтоДт Цикл
					НоваяЗапись.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
				КонецЦикла;

				Для каждого Субконто Из ЗаписьНабора.СубконтоКт Цикл
					НоваяЗапись.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
				КонецЦикла;
				
			КонецЦикла;
		Иначе
			Для каждого ЗаписьНабора Из Набор Цикл
			
				НоваяЗапись = НаборТекущегоОбъекта.Добавить();
				Если Метаданные.РегистрыНакопления.Найти(НаборИмяМетаданного) <> Неопределено Тогда
					Если НаборТекущегоОбъекта.Метаданные().ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
						НоваяЗапись.ВидДвижения = ЗаписьНабора.ВидДвижения;
					КонецЕсли;
				КонецЕсли;
				НоваяЗапись.Период = ТекущаяДата();
				
				Если Метаданные.РегистрыНакопления.Найти(НаборИмяМетаданного) <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,, "Период, Регистратор, ВидДвижения");
				Иначе
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора,, "Период, Регистратор");
				КонецЕсли;
			
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение реквизитов регистров Период и Организация
	Для каждого НаборЗаписей Из Движения Цикл
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПустаяТаблица   = НаборЗаписей.ВыгрузитьКолонки();
		ЕстьОрганизация = ПустаяТаблица.Колонки.Найти("Организация") <> Неопределено;
		ЕстьПериод      = ПустаяТаблица.Колонки.Найти("Период") <> Неопределено;
		
		Если НЕ (ЕстьОрганизация ИЛИ ЕстьПериод) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДвижений = НаборЗаписей.Выгрузить();
		Если ЕстьОрганизация Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		КонецЕсли;
		Если ЕстьПериод Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		КонецЕсли;
		НаборЗаписей.Загрузить(ТаблицаДвижений);
		
		// Актуализируем списки регистров
		ИмяРегистра = НаборЗаписей.Метаданные().Имя;
		Если Метаданные.РегистрыНакопления.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрНакопления(ИмяРегистра);
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрСведений(ИмяРегистра);
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрРасчета(ИмяРегистра);
		КонецЕсли;
	
	КонецЦикла;
	
	СинхронизироватьАктивностьДвиженийСПометкойУдаления();
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	Если СпособЗаполнения = "СторноДвиженийДокумента" Тогда // это идентификатор
		Если ЗаполнениеДвижений.Количество() > 0 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СторнируемыйДокумент");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ЗаполнениеДвижений.Документ");
		МассивНепроверяемыхРеквизитов.Добавить("СторнируемыйДокумент");
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли
